app/Controllers/admin/Member.php

SELECT *
FROM `tb_provinsi`
SELECT *
FROM `tb_kabkota`
---
    public function tambah()
    {
        $provinsi_model = new ProvinsiModels();
        $kabkota_model = new KabkotaModels();

        $provinsi = $provinsi_model->findAll();
        $kabkota = $kabkota_model->findAll();

INSERT INTO `tb_member` (`username`, `password`, `nama_member`, `id_kabkota`, `status_kepengurusan`, `alamat_member`, `no_hp_member`, `email_member`, `ig_member`, `fb_member`, `pendidikan_member`, `pekerjaan_member`, `sertifikasi_member`, `jenis_kelamin`, `foto_member`, `cv_member`) VALUES ('aku', 'aku', 'aku', '1', 'sad', 'asd', '', '', '', '', '', '', '', 'Laki-laki', '', '')
---
        'cv_member' => $cvName  // Simpan nama file CV
    ];

    $member_model->save($data);

SELECT *
FROM `tb_member`
WHERE `tb_member`.`id_member` = '25'
SELECT *
FROM `tb_provinsi`
SELECT *
FROM `tb_kabkota`
---
public function edit($id_member)
{
    $member_model = new MemberModels();
    $provinsi_model = new ProvinsiModels();
    $kabkota_model = new KabkotaModels();

    // Ambil data member, provinsi, dan kabkota
    $member = $member_model->find($id_member);
    $provinsi = $provinsi_model->findAll();
    $kabkota = $kabkota_model->findAll();