app/Models/MemberModels.php

    public function getAllMembersWithLocation()
    {
        return $this->select('tb_member.*, tb_provinsi.nama_provinsi, tb_kabkota.nama_kabkota')
                    ->join('tb_provinsi', 'tb_member.id_provinsi = tb_provinsi.id_provinsi', 'left')
                    ->join('tb_kabkota', 'tb_member.id_kabkota = tb_kabkota.id_kabkota', 'left')
                    ->findAll();
---
SELECT `tb_member`.*, `tb_provinsi`.`nama_provinsi`, `tb_kabkota`.`nama_kabkota`
FROM `tb_member`
LEFT JOIN `tb_provinsi` ON `tb_member`.`id_provinsi` = `tb_provinsi`.`id_provinsi`
LEFT JOIN `tb_kabkota` ON `tb_member`.`id_kabkota` = `tb_kabkota`.`id_kabkota`