app/Controllers/NewUser/VideoController.php

    public function index()
    {
        $kategoriVideoModels = $this->kategoriVideoModels->findAll();
        $videoPembelajaranModels = $this->videoPembelajaranModels->findAll();
---
SELECT *
FROM `tb_kategori_video`
SELECT *
FROM `tb_video`